vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/stm32h503/I2C_reginfo.h
/* This file is generated by stm32_reggen.py from stm32h503xx.h
 * Do not edit this file manually! 
 * If corrections are needed, use the 
 * override mechanism(s) defined to modify the parsed results 
 * and re-run the script to update the file. 
 *
 * This file contains the I2C register metadata for the stm32h503 series of chips. 
 */

#pragma once
#include "../../stm32_gen_common.h"
static const stm32_reginfo_t stm32_h503_i2c_reginfo[RI_END] = 
{ 
	[RI_CR1            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xC1FFFFFF }, /* mask = 0b11000001111111111111111111111111 */
	[RI_CR2            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x07FFFFFF }, /* mask = 0b00000111111111111111111111111111 */
	[RI_OAR1           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x000087FF, .mask = 0x000087FF }, /* mask = 0b00000000000000001000011111111111 */
	[RI_OAR2           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x000087FE, .mask = 0x000087FE }, /* mask = 0b00000000000000001000011111111110 */
	[RI_TIMINGR        ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0xF0FFFFFF, .mask = 0xF0FFFFFF }, /* mask = 0b11110000111111111111111111111111 */
	[RI_TIMEOUTR       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x8FFF9FFF, .mask = 0x8FFF9FFF }, /* mask = 0b10001111111111111001111111111111 */
	[RI_ISR            ] = { .reset_val = 0x00000001, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00FFBFFF }, /* mask = 0b00000000111111111011111111111111 */
	[RI_ICR            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00003F38 }, /* mask = 0b00000000000000000011111100111000 */
	[RI_PECR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x000000FF, .mask = 0x000000FF }, /* mask = 0b00000000000000000000000011111111 */
	[RI_RXDR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x000000FF }, /* mask = 0b00000000000000000000000011111111 */
	[RI_TXDR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x000000FF }, /* mask = 0b00000000000000000000000011111111 */
}; 

